{
  "月饼": "A round pastry filled with sweet bean paste or lotus seed paste, eaten during Mid-Autumn Festival.",
  "汤圆": "Glutinous rice balls filled with sweet sesame or peanut paste, eaten during Lantern Festival.",
  "年糕": "Steamed glutinous rice cake symbolizing growth and progress, eaten during Chinese New Year.",
  "粽子": "Glutinous rice wrapped in bamboo leaves with various fillings, eaten during Dragon Boat Festival.",
  "元宵": "Sweet glutinous rice balls served in soup, eaten during Lantern Festival.",
  "春卷": "Crispy fried rolls with sweet or savory fillings, eaten during Spring Festival.",
  "八宝饭": "Steamed glutinous rice with eight precious ingredients, eaten during Chinese New Year.",
  "麻糍": "Soft glutinous rice cake coated with sesame and sugar, eaten during various festivals.",
  "糖葫芦": "Candied hawthorn berries on a stick, a popular winter snack during festivals.",
  "龙须糖": "Fine, hair-like sugar strands wrapped around peanut filling, eaten during traditional festivals.",
  "老婆饼": "Flaky pastry with sweet winter melon filling, eaten as everyday dessert or during festivals.",
  "杏仁豆腐": "Soft almond-flavored jelly served chilled, eaten during summer festivals.",
  "豆沙包": "Steamed buns filled with sweet red bean paste, eaten as breakfast or festival food.",
  "芝麻球": "Deep-fried glutinous rice balls coated with sesame seeds, eaten during festivals.",
  "桂花糕": "Steamed rice cake flavored with osmanthus flowers, eaten during Mid-Autumn Festival.",
  "绿豆糕": "Mung bean pastry with delicate texture, eaten during Dragon Boat Festival.",
  "凤梨酥": "Pineapple-filled pastry from Taiwan, eaten as gift during festivals.",
  "蛋挞": "Portuguese-inspired egg tarts with flaky crust, popular in Hong Kong during festivals.",
  "糖不甩": "Sweet glutinous rice balls in peanut and sesame coating, eaten during winter festivals.",
  "腐竹白果糖水": "Sweet soup with bean curd skin and ginkgo nuts, eaten during winter festivals.",
  "杨枝甘露": "Chilled dessert with mango, pomelo and sago, eaten during summer festivals.",
  "双皮奶": "Steamed milk pudding with double skin layer, eaten as Cantonese dessert during festivals.",
  "姜撞奶": "Ginger-flavored milk curd, eaten as warming dessert during winter festivals.",
  "龟苓膏": "Bitter herbal jelly served with honey, eaten as cooling dessert during summer.",
  "花生汤": "Sweet peanut soup often served with youtiao, eaten during winter festivals.",
  "酒酿圆子": "Sweet fermented rice soup with glutinous rice balls, eaten during winter festivals.",
  "红豆沙": "Sweet red bean soup often served with tangyuan, eaten during winter festivals.",
  "黑芝麻糊": "Warm black sesame paste, eaten as nutritious dessert during winter festivals.",
  "冰糖葫芦": "Rock sugar coated hawthorn berries, traditional winter snack during festivals.",
  "驴打滚": "Glutinous rice roll with red bean paste coated in soybean flour, Beijing snack for festivals.",
  "豌豆黄": "Sweet pea paste cake, traditional Beijing dessert served during spring festivals.",
  "芸豆卷": "Kidney bean paste rolls, imperial dessert eaten during traditional festivals.",
  "糖耳朵": "Sweet fried dough shaped like ears, Beijing snack for temple fairs.",
  "炸鲜奶": "Deep-fried milk custard, popular Cantonese dessert during festivals.",
  "椰汁马豆糕": "Coconut milk pudding with green beans, Hong Kong dessert for festivals.",
  "白糖糕": "Fermented rice cake with slightly sour taste, traditional Cantonese festival food.",
  "马拉糕": "Steamed brown sugar sponge cake, dim sum dessert for festive occasions.",
  "蜂巢糕": "Honeycomb-patterned steamed cake, popular during Chinese New Year.",
  "鸡仔饼": "Savory-sweet cookies with pork fat and nuts, Guangdong festival snack.",
  "光酥饼": "Light sponge cookies without oil, traditional festival pastry.",
  "笑口枣": "Deep-fried sesame balls that crack open like smiles, festive snack.",
  "煎堆": "Deep-fried glutinous rice balls with sesame, eaten during Chinese New Year.",
  "油角": "Deep-fried dumplings with sweet filling, Chinese New Year snack.",
  "蛋散": "Crispy fried dough strips dipped in syrup, Chinese New Year dessert.",
  "年宵": "Various sweets and snacks specifically for Chinese New Year Eve.",
  "糖瓜": "Malt sugar melons offered to Kitchen God before Chinese New Year.",
  "关东糖": "Hard malt candy eaten during Laba Festival.",
  "腊八粥": "Eight-treasure porridge eaten during Laba Festival.",
  "青团": "Green glutinous rice balls with sweet fillings, eaten during Qingming Festival.",
  "艾粑": "Mugwort-flavored glutinous rice cakes, Qingming Festival food.",
  "乌饭": "Black glutinous rice steamed with leaves, eaten during April festival.",
  "重阳糕": "Multi-layer steamed cake eaten during Double Ninth Festival.",
  "菊花酒": "Chrysanthemum-infused wine drunk during Double Ninth Festival.",
  "太阳饼": "Taiwanese pastry with malt sugar filling, popular festival gift.",
  "牛舌饼": "Flaky pastry shaped like ox tongue with sweet filling, festival snack.",
  "冬瓜糖": "Candied winter melon strips, traditional wedding and festival candy.",
  "糖莲藕": "Candied lotus root, symbolic wedding and festival sweet.",
  "糖莲子": "Candied lotus seeds, symbolizing fertility in weddings and festivals.",
  "糖马蹄": "Candied water chestnuts, crisp festival sweets.",
  "糖金桔": "Candied kumquats, symbolizing prosperity during Chinese New Year.",
  "糖椰角": "Candied coconut pieces, festival snack and gift.",
  "糖姜片": "Candied ginger slices, eaten during winter festivals.",
  "九层糕": "Nine-layer steamed rice cake, eaten during Chongyang Festival.",
  "千层糕": "Multi-layer steamed cake with coconut, festival dessert.",
  "萝卜糕": "Turnip cake often served during Chinese New Year.",
  "芋头糕": "Taro root cake, popular during Chinese New Year.",
  "马蹄糕": "Water chestnut cake with translucent appearance, spring festival food.",
  "红豆糕": "Red bean cake, commonly served during tea time and festivals.",
  "椰汁糕": "Coconut milk pudding, refreshing summer festival dessert.",
  "芒果布甸": "Mango pudding, modern Hong Kong dessert for festive occasions.",
  "西米露": "Sweet sago soup with various fruits, summer festival dessert.",
  "番薯糖水": "Sweet potato soup, comforting winter dessert during festivals.",
  "莲子羹": "Lotus seed sweet soup, nourishing dessert for festivals.",
  "银耳羹": "Snow fungus sweet soup, beauty dessert for festive occasions.",
  "核桃糊": "Walnut paste sweet soup, brain-nourishing festival dessert.",
  "杏仁茶": "Almond tea, warm dessert during winter festivals.",
  "花生糊": "Peanut paste, nutritious dessert for winter festivals.",
  "腰果糊": "Cashew nut paste, rich dessert for special occasions.",
  "凤凰卷": "Egg rolls with coconut filling, Chinese New Year snack.",
  "蛋卷": "Crispy egg rolls, popular festival gift and snack.",
  "米通": "Puffed rice cakes with sugar, traditional festival snack.",
  "花生糖": "Peanut brittle, common festival candy.",
  "芝麻糖": "Sesame brittle, traditional Chinese New Year candy.",
  "瓜子糖": "Melon seed candy, festive treat.",
  "姜糖": "Ginger candy, eaten during winter festivals.",
  "龙糖": "Dragon-shaped candy, children's festival treat.",
  "冰糖": "Rock sugar used in various desserts and sweet soups.",
  "麦芽糖": "Malt sugar, traditional candy for festivals.",
  "叮叮糖": "Hard malt sugar that needs hammering, old Beijing festival candy.",
  "梨膏糖": "Pear syrup candy with herbal ingredients, eaten during season changes.",
  "山楂糕": "Hawthorn fruit jelly, digestive aid during festive overeating.",
  "果丹皮": "Hawthorn fruit rolls, popular festival snack.",
  "蜜饯": "Preserved fruits in honey, common festival gift.",
  "话梅": "Salted dried plums, popular snack during festivals.",
  "陈皮梅": "Dried plums with orange peel, festival snack.",
  "嘉应子": "Special preserved plum, festival delicacy.",
  "芒果干": "Dried mango slices, modern festival snack.",
  "荔枝干": "Dried lychees, traditional festival gift.",
  "龙眼干": "Dried longan, nutritious festival food.",
  "红枣": "Dried red dates, essential in festival desserts.",
  "蜜枣": "Honey dates, sweet addition to festival dishes.",
  "柿饼": "Dried persimmons, winter festival snack.",
  "葡萄干": "Raisins, common in festival desserts.",
  "无花果干": "Dried figs, healthy festival snack.",
  "菠萝干": "Dried pineapple, tropical festival treat.",
  "香蕉干": "Dried banana chips, children's festival snack.",
  "糖炒栗子": "Sugar-roasted chestnuts, winter street food during festivals.",
  "烤红薯": "Baked sweet potatoes, warming winter festival snack.",
  "冰糖炖雪梨": "Rock sugar steamed pear, soothing dessert during dry seasons.",
  "酒糟蛋": "Eggs cooked in fermented rice wine, postpartum and festival food.",
  "红糖糍粑": "Fried glutinous rice cakes with brown sugar, Sichuan festival dessert.",
  "三大炮": "Glutinous rice balls thrown to make noise, Sichuan festival specialty.",
  "叶儿粑": "Leaf-wrapped glutinous rice cakes, Sichuan festival food.",
  "凉糕": "Chilled rice cake with brown sugar, summer festival dessert.",
  "冰粉": "A refreshing, clear jelly served cold with brown sugar syrup and toppings, a summer street food.",
  "豆腐脑": "Sweet or savory tofu pudding, popular breakfast and snack during festivals.",
  "甜豆浆": "Sweet soy milk, common breakfast drink during festivals.",
  "珍珠奶茶": "Bubble tea with tapioca pearls, modern festival drink.",
  "仙草冻": "Grass jelly in sweet syrup, cooling summer festival dessert.",
  "爱玉冰": "Aiyu jelly made from fig seeds, Taiwanese summer festival dessert.",
  "豆花": "Soft tofu dessert with sweet toppings, popular during festivals.",
  "红糖冰": "Shaved ice with brown sugar, summer festival treat.",
  "芒果冰": "Mango shaved ice, modern Taiwanese festival dessert.",
  "芋圆": "Taro balls in sweet soup, Taiwanese festival dessert.",
  "地瓜圆": "Sweet potato balls, common in Taiwanese dessert soups.",
  "粉粿": "Clear steamed dumplings with sweet fillings, festival dessert.",
  "水晶饼": "Translucent pastry with sweet fillings, traditional festival gift."
}